stub.txt

[{"Name":"POST|http://athena13:9582/ReadNewCardWS|500 Internal Server Error|","Request":{"URI":"","Host":"athena13:9582","Path":"/ReadNewCardWS","Method":"POST","Body":"POST /ReadNewCardWS HTTP/1.1\r\nHost: athena13:9582\r\nAccept: */*\r\nContent-Type: application/x-www-form-urlencoded\r\nProxy-Connection: Keep-Alive\r\nReferer: rbose\r\nUser-Agent: curl/7.43.0\r\nX-Forwarded-For: 127.0.0.1\r\n\r\n\u003csoapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:urn=\"urn:pack.INReadNewCardWS_typedef.salt11\"\u003e   \u003csoapenv:Header/\u003e   \u003csoapenv:Body\u003e      \u003curn:ReadNewCardWS\u003e         \u003curn:inbuf\u003e            \u003curn:USER_CODE\u003eLLCHAILUCK\u003c/urn:USER_CODE\u003e            \u003curn:RD_CARD__CARD_NUMB\u003e8966051307484031399\u003c/urn:RD_CARD__CARD_NUMB\u003e            \u003curn:SUBR_NUMB\u003e66905512585\u003c/urn:SUBR_NUMB\u003e            \u003curn:BLPD_CODE\u003e02\u003c/urn:BLPD_CODE\u003e            \u003curn:FUNC_ID\u003e3\u003c/urn:FUNC_ID\u003e            \u003curn:DMMY_ALLW_FLAG\u003e\u003c/urn:DMMY_ALLW_FLAG\u003e            \u003curn:CARD_NUMB\u003e8966181307418951954\u003c/urn:CARD_NUMB\u003e            \u003curn:RD_CARD__LIVE_FLAG\u003e\u003c/urn:RD_CARD__LIVE_FLAG\u003e         \u003c/urn:inbuf\u003e      \u003c/urn:ReadNewCardWS\u003e   \u003c/soapenv:Body\u003e\u003c/soapenv:Envelope\u003e"},"Response":{"Status":"500 Internal Server Error","StatusCode":500,"Body":"HTTP/1.1 500 Internal Server Error\r\nConnection: close\r\nContent-Length: 319\r\nContent-Type: text/xml; charset=UTF-8\r\nServer: gSOAP/2.7\r\n\r\n\u003c?xml version=\"1.0\" encoding=\"UTF-8\"?\u003e\n\u003cSOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"\u003e\u003cSOAP-ENV:Body\u003e\u003cSOAP-ENV:Fault\u003e\u003cfaultcode\u003eSOAP-ENV:Client\u003c/faultcode\u003e\u003cfaultstring\u003eGWWS_CAT:1019: Security Error: Authentication Failed.\u003c/faultstring\u003e\u003c/SOAP-ENV:Fault\u003e\u003c/SOAP-ENV:Body\u003e\u003c/SOAP-ENV:Envelope\u003e"}},{"Name":"POST|http://athena13:9582/ReadNewCardWS|500 Internal Server Error|","Request":{"URI":"","Host":"athena13:9582","Path":"/ReadNewCardWS","Method":"POST","Body":"POST /ReadNewCardWS HTTP/1.1\r\nHost: athena13:9582\r\nAccept: */*\r\nContent-Type: application/x-www-form-urlencoded\r\nProxy-Connection: Keep-Alive\r\nReferer: rbose\r\nUser-Agent: curl/7.43.0\r\nX-Forwarded-For: 127.0.0.1\r\n\r\n\u003csoapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:urn=\"urn:pack.INReadNewCardWS_typedef.salt11\"\u003e   \u003csoapenv:Header/\u003e   \u003csoapenv:Body\u003e      \u003curn:ReadNewCardWS\u003e         \u003curn:inbuf\u003e            \u003curn:USER_CODE\u003eLLCHAILUCK\u003c/urn:USER_CODE\u003e            \u003curn:RD_CARD__CARD_NUMB\u003e8966051307484031399\u003c/urn:RD_CARD__CARD_NUMB\u003e            \u003curn:SUBR_NUMB\u003e66905512585\u003c/urn:SUBR_NUMB\u003e            \u003curn:BLPD_CODE\u003e02\u003c/urn:BLPD_CODE\u003e            \u003curn:FUNC_ID\u003e3\u003c/urn:FUNC_ID\u003e            \u003curn:DMMY_ALLW_FLAG\u003e\u003c/urn:DMMY_ALLW_FLAG\u003e            \u003curn:CARD_NUMB\u003e8966181307418951954\u003c/urn:CARD_NUMB\u003e            \u003curn:RD_CARD__LIVE_FLAG\u003e\u003c/urn:RD_CARD__LIVE_FLAG\u003e         \u003c/urn:inbuf\u003e      \u003c/urn:ReadNewCardWS\u003e   \u003c/soapenv:Body\u003e\u003c/soapenv:Envelope\u003e"},"Response":{"Status":"500 Internal Server Error","StatusCode":500,"Body":"HTTP/1.1 500 Internal Server Error\r\nConnection: close\r\nContent-Length: 319\r\nContent-Type: text/xml; charset=UTF-8\r\nServer: gSOAP/2.7\r\n\r\n\u003c?xml version=\"1.0\" encoding=\"UTF-8\"?\u003e\n\u003cSOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"\u003e\u003cSOAP-ENV:Body\u003e\u003cSOAP-ENV:Fault\u003e\u003cfaultcode\u003eSOAP-ENV:Client\u003c/faultcode\u003e\u003cfaultstring\u003eGWWS_CAT:1019: Security Error: Authentication Failed.\u003c/faultstring\u003e\u003c/SOAP-ENV:Fault\u003e\u003c/SOAP-ENV:Body\u003e\u003c/SOAP-ENV:Envelope\u003e"}},{"Name":"POST|http://athena13:9582/ReadNewCardWS|500 Internal Server Error|","Request":{"URI":"","Host":"athena13:9582","Path":"/ReadNewCardWS","Method":"POST","Body":"POST /ReadNewCardWS HTTP/1.1\r\nHost: athena13:9582\r\nAccept: */*\r\nContent-Type: application/x-www-form-urlencoded\r\nProxy-Connection: Keep-Alive\r\nReferer: rbose\r\nUser-Agent: curl/7.43.0\r\nX-Forwarded-For: 127.0.0.1\r\n\r\n\u003csoapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:urn=\"urn:pack.INReadNewCardWS_typedef.salt11\"\u003e   \u003csoapenv:Header/\u003e   \u003csoapenv:Body\u003e      \u003curn:ReadNewCardWS\u003e         \u003curn:inbuf\u003e            \u003curn:USER_CODE\u003eLLCHAILUCK\u003c/urn:USER_CODE\u003e            \u003curn:RD_CARD__CARD_NUMB\u003e8966051307484031399\u003c/urn:RD_CARD__CARD_NUMB\u003e            \u003curn:SUBR_NUMB\u003e66905512585\u003c/urn:SUBR_NUMB\u003e            \u003curn:BLPD_CODE\u003e02\u003c/urn:BLPD_CODE\u003e            \u003curn:FUNC_ID\u003e3\u003c/urn:FUNC_ID\u003e            \u003curn:DMMY_ALLW_FLAG\u003e\u003c/urn:DMMY_ALLW_FLAG\u003e            \u003curn:CARD_NUMB\u003e8966181307418951954\u003c/urn:CARD_NUMB\u003e            \u003curn:RD_CARD__LIVE_FLAG\u003e\u003c/urn:RD_CARD__LIVE_FLAG\u003e         \u003c/urn:inbuf\u003e      \u003c/urn:ReadNewCardWS\u003e   \u003c/soapenv:Body\u003e\u003c/soapenv:Envelope\u003e"},"Response":{"Status":"500 Internal Server Error","StatusCode":500,"Body":"HTTP/1.1 500 Internal Server Error\r\nConnection: close\r\nContent-Length: 319\r\nContent-Type: text/xml; charset=UTF-8\r\nServer: gSOAP/2.7\r\n\r\n\u003c?xml version=\"1.0\" encoding=\"UTF-8\"?\u003e\n\u003cSOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"\u003e\u003cSOAP-ENV:Body\u003e\u003cSOAP-ENV:Fault\u003e\u003cfaultcode\u003eSOAP-ENV:Client\u003c/faultcode\u003e\u003cfaultstring\u003eGWWS_CAT:1019: Security Error: Authentication Failed.\u003c/faultstring\u003e\u003c/SOAP-ENV:Fault\u003e\u003c/SOAP-ENV:Body\u003e\u003c/SOAP-ENV:Envelope\u003e"}}]